[
	{
		"title": "Implementing Bit Field Role-Based Access Control (RBAC)",
		"description": "Master Bit Field Role-Based Access Control to efficiently manage user permissions with binary encoding. Learn how to implement it with Express.js and Prisma for streamlined access control",
		"link": "https://blog.yarsalabs.com/implementing-bit-field-role-based-access-control/"
	},
	{
		"title": "Understanding Signal Protocol: X3DH Protocol",
		"description": "Learn how Signal protects your communication from prying eyes. This article explains the Signal Protocol in detail, breaking down key exchange, prekeys, and how it keeps your messages private.",
		"dateFormatted": "March 5th, 2024",

		"link": "https://blog.yarsalabs.com/understanding-signal-protocol-for-end-to-end-encryption/"
	},
	{
		"title": "Text Summarization in Python",
		"description": "Learn about abstractive summarization, use of transformers in summarization model and implementation of abstractive summarization in Python.",
		"dateFormatted": "January 31, 2024",
		"link": "https://blog.yarsalabs.com/text-summarization-in-python-part-2/"
	},
	{
		"title": "Functional Programming Essentials: Crafting Clean and Effective Code",
		"description": "Learn how to write clean and effective code using pure functions, immutability, recursion and unravel the magic of 'functional' functions.",
		"dateFormatted": "Sep 11th, 2023",
		"link": "https://blog.yarsalabs.com/functional-programming-essentials-crafting-clean-and-effective-code/"
	},
	{
		"title": "Validate Image with Magic Bytes in React",
		"description":"Learn how to securely validate image files in React using magic bytes. To mitigate risks, combine client-side checks with robust server-side validation.",
		"dateFormatted": "April 19th, 2024",
		"link": "https://blog.yarsalabs.com/validate-image-with-magic-numbers-in-react/"
	},
	{
		"title": "Understanding the Node.js Architecture",
		"description": "Explore the magic of NodeJS as we delve into its single-threaded, non-blocking, and event-driven architecture, powered by Chrome V8 engine and libuv library, to create efficient and cross-platform applications.",
		"dateFormatted": "Sep 28th, 2023",
		"link": "https://blog.yarsalabs.com/understanding-the-nodejs-architecture/"
	}
]
